 ## **Importing Libraries**

In [175]:
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score, mean_squared_error

 ## **Load Data**

In [176]:
df = pd.read_csv("Data_file.csv")
dftest = pd.read_csv("Test_data.csv")

## Exploratory Data Analysis

In [157]:
df.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,1,Tier 1,Manager,Non-Metro,"55,523.00",3,66,19,"71,406.58"
1,2,Tier 2,Executive,Metro,"57,081.00",1,84,18,"68,005.87"
2,3,Tier 2,Executive,Metro,"60,347.00",2,52,28,"76,764.02"
3,4,Tier 3,Executive,Metro,"49,010.00",2,81,33,"82,092.39"
4,5,Tier 3,Executive,Metro,"57,879.00",4,74,32,"73,878.10"

In [177]:
df.dtypes

S.No.                    int64
College                 object
Role                    object
City type               object
Previous CTC            object
Previous job changes     int64
Graduation marks         int64
Exp (Months)             int64
CTC                     object
dtype: object

In [159]:
df['Previous CTC'] = (df['Previous CTC'].str.replace(',', '')).astype(float).astype(int)
df['CTC'] = (df['CTC'].str.replace(',', '')).astype(float).astype(int)

In [160]:
role = {
    'Manager' : 1,
    'Executive' : 2,
}
college = {
    'Tier 1' : 1,
    'Tier 2' : 2,
    'Tier 3' : 3,
}
city_type = {
    'Non-Metro' : 0,
    'Metro' : 1,
}

In [161]:
df["Role"] = df["Role"].apply(lambda x : role[x])
df["College"] = df["College"].apply(lambda x : college[x])
df["City type"] = df["City type"].apply(lambda x : city_type[x])

In [162]:
df.drop(['S.No.'], inplace = True, axis = 1)

In [163]:
df.head()

,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,1,1,0,55523,3,66,19,71406
1,2,2,1,57081,1,84,18,68005
2,2,2,1,60347,2,52,28,76764
3,3,2,1,49010,2,81,33,82092
4,3,2,1,57879,4,74,32,73878

## Modeling

In [164]:
X_train = df.drop(['CTC'], axis = 1)
y_train = df['CTC']

In [178]:
model = LinearRegression ()
model.fit(X_train, y_train)

LinearRegression()

## Testing

In [166]:
dftest.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,Predicted CTC
0,1,Tier 1,Manager,Non-Metro,55523,3,66,19,71406.57653,NaN
1,2,Tier 2,Executive,Metro,57081,1,84,18,68005.87063,NaN
2,3,Tier 2,Executive,Metro,60347,2,52,28,76764.02028,NaN
3,4,Tier 3,Executive,Metro,49010,2,81,33,82092.38688,NaN
4,5,Tier 3,Executive,Metro,57879,4,74,32,73878.09773,NaN

In [167]:
dftest['CTC'] = dftest['CTC'].astype(int)

In [168]:
dftest["Role"] = dftest["Role"].apply(lambda x : role[x])
dftest["College"] = dftest["College"].apply(lambda x : clg[x])
dftest["City type"] = dftest["City type"].apply(lambda x : ct[x])

In [169]:
dftest.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,Predicted CTC
0,1,1,1,0,55523,3,66,19,71406,NaN
1,2,2,2,1,57081,1,84,18,68005,NaN
2,3,2,2,1,60347,2,52,28,76764,NaN
3,4,3,2,1,49010,2,81,33,82092,NaN
4,5,3,2,1,57879,4,74,32,73878,NaN

In [179]:
X_test = dftest.drop(['S.No.', 'CTC', 'Predicted CTC'], axis = 1)
y_test = dftest['CTC']

In [171]:
predictions = model.predict(X_test)

In [172]:
for i in range(len(dftest["Predicted CTC"])):
    dftest["Predicted CTC"][i] = predictions[i]

C:\Users\ANSHBA~1\AppData\Local\Temp/ipykernel_16252/3640587260.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dftest["Predicted CTC"][i] = predictions[i]

In [173]:
dftest.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,Predicted CTC
0,1,1,1,0,55523,3,66,19,71406,85243.943538
1,2,2,2,1,57081,1,84,18,68005,67889.514462
2,3,2,2,1,60347,2,52,28,76764,71953.815578
3,4,3,2,1,49010,2,81,33,82092,65903.548117
4,5,3,2,1,57879,4,74,32,73878,69136.774491

## Result

In [174]:
print (' R2: {} MSE: {} '. format( r2_score(y_test, predictions), mean_squared_error(y_test, predictions)))

 R2: 0.5967919365822936 MSE: 63471804.87910448